In [11]:
#Fonte de dados:https://www.kaggle.com/datasets/benroshan/ecommerce-data?datasetId=615631

In [12]:
# Import some libraries
import pandas as pd
import numpy as np

In [17]:
# Used to pandas library to read csv files:
df = pd.read_csv('List of Orders.csv')

In [14]:
df

    Order ID  Order Date CustomerName           State       City
0    B-25601  01-04-2018       Bharat         Gujarat  Ahmedabad
1    B-25602  01-04-2018        Pearl     Maharashtra       Pune
2    B-25603  03-04-2018        Jahan  Madhya Pradesh     Bhopal
3    B-25604  03-04-2018       Divsha       Rajasthan     Jaipur
4    B-25605  05-04-2018      Kasheen     West Bengal    Kolkata
..       ...         ...          ...             ...        ...
555      NaN         NaN          NaN             NaN        NaN
556      NaN         NaN          NaN             NaN        NaN
557      NaN         NaN          NaN             NaN        NaN
558      NaN         NaN          NaN             NaN        NaN
559      NaN         NaN          NaN             NaN        NaN

[560 rows x 5 columns]

In [15]:
# head method on pandas, used to dataframes, could show us 5 first lines of our dataset.
df.head()

  Order ID  Order Date CustomerName           State       City
0  B-25601  01-04-2018       Bharat         Gujarat  Ahmedabad
1  B-25602  01-04-2018        Pearl     Maharashtra       Pune
2  B-25603  03-04-2018        Jahan  Madhya Pradesh     Bhopal
3  B-25604  03-04-2018       Divsha       Rajasthan     Jaipur
4  B-25605  05-04-2018      Kasheen     West Bengal    Kolkata

In [16]:
# On the other hands, tail method on pandas library could show us the last 3 lines on our dataset.
df.tail()

    Order ID Order Date CustomerName State City
555      NaN        NaN          NaN   NaN  NaN
556      NaN        NaN          NaN   NaN  NaN
557      NaN        NaN          NaN   NaN  NaN
558      NaN        NaN          NaN   NaN  NaN
559      NaN        NaN          NaN   NaN  NaN

In [18]:
# Counting how many line and columns on our database with shape method.
df.shape #(lines, columns)

(560, 5)

In [24]:
# Show all columns
df.columns

Index(['Order ID', 'Order Date', 'CustomerName', 'State', 'City'], dtype='object')

In [25]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
555     True
556     True
557     True
558     True
559     True
Length: 560, dtype: bool

In [19]:
# How many duplicate line there are on dataset 
df.duplicated().sum()

59

In [20]:
# Show us data about metadata
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 560 entries, 0 to 559
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      500 non-null    object
 1   Order Date    500 non-null    object
 2   CustomerName  500 non-null    object
 3   State         500 non-null    object
 4   City          500 non-null    object
dtypes: object(5)
memory usage: 22.0+ KB

In [21]:
# How many empty space are there?
df.isna().sum()

Order ID        60
Order Date      60
CustomerName    60
State           60
City            60
dtype: int64

In [22]:
# Summary Statistical
df.describe()

       Order ID  Order Date CustomerName           State    City
count       500         500          500             500     500
unique      500         307          332              19      24
top     B-25601  24-11-2018       Shreya  Madhya Pradesh  Indore
freq          1           7            6             101      76

In [23]:
# Summary Statistical, include categorical variables
df.describe(include = 'all')

       Order ID  Order Date CustomerName           State    City
count       500         500          500             500     500
unique      500         307          332              19      24
top     B-25601  24-11-2018       Shreya  Madhya Pradesh  Indore
freq          1           7            6             101      76